{
    "introduccion_titulo": "Hello, I'm Toni!",
    "introduccion_subtitulo": "Software Engineer & Fronted Developer",
    "introduccion_texto": "Passionate about creating interactive and visually attractive web experiences.",
    "introduccion_texto_2": "Explore my portfolio to see examples of my work!",
    "introduccion_cv": "Download my CV",
    "introduccion_linkedin": "LinkedIn",
    "introduccion_github": "GitHub",
    "experiencia_titulo": "Work experience",
    "ver_proyecto": "See project",
    "experiencia_amura_titulo": "Amura IT",
    "experiencia_amura_fecha": "October 2021 - June 2022",
    "experiencia_amura_subtitulo": "I mainly dedicated myself to developing internal software for Roche, it was a challenge for me since I had never touched the backend part.",
    "experiencia_amura_textos_1": "Datamining of the Roche database to later create a web with Vue 2 that shows graphs of the extracted results, this helped to have a broader vision about the shipments and manufacture of medicines according to the time of year.",
    "experiencia_amura_textos_2": "Pixel Perfect layout of the Stories section for the Roche website developed with React.",
    "experiencia_amura_textos_3": "Creation of APIs that connect the Roche DB to its internal web.",
    "experiencia_amura_logos": [],
    "experiencia_satec_titulo": "Satec",
    "experiencia_satec_fecha": "June 2022 - May 2023",
    "experiencia_satec_subtitulo": "I started to specialize as a frontend developing websites from scratch with Vue 3 or adding new sections to already deployed websites.",
    "experiencia_satec_textos_1": "We worked with SCRUM methodology, where every week we defined the weekly sprints and we pointed them out in Jira, using Git we uploaded to Dev the incidents/tasks assigned in Jira, once checked a Pull request was made to Pre and on Thursdays all the Pull requests were passed to production. All pull requests were made with Cherry picks.",
    "experiencia_satec_textos_2": "I developed sections of the Insurama website for clients with Vue 2.",
    "experiencia_satec_textos_3": "I also made the Palacio de hierro website with Vue 3 and Nuxt.",
    "experiencia_satec_textos_4": "I remodeled the informative website of Insurama with Wordpress and CSS",
    "experiencia_satec_logos": [],
    "experiencia_netlu_titulo": "Netlu Solucions",
    "experiencia_netlu_fecha": "January 2019 - June 2021",
    "experiencia_netlu_subtitulo": "It was my first company, I started the practices and then they hired me, we developed from scratch an internal communication website for Salvador Escoda workers in the style of Jira.",
    "experiencia_netlu_textos_1": "The website was developed with Vue 2, we also used Vuex and Vue-router, I was in charge of styling the website and developing its logic.",
    "experiencia_netlu_textos_2": "I created a real-time chat using web sockets, specifically I used the Socket.io library.",
    "experiencia_netlu_logos": [],
    "experiencia_jl_titulo": "JL Sound",
    "experiencia_jl_fecha": "April 2023 - June 2023",
    "experiencia_jl_subtitulo": "Website developed for Joel Lozano, a music producer who works for artists like Cariño, Delaporte, Ana Guerra and Blas Cantó among others. An opportunity to design and develop a website with my favorite frameworks.",
    "experiencia_jl_textos_1": "The website was designed with Figma, you have the link here.",
    "experiencia_jl_textos_2": "The client gave me wide freedom for its design and development so I could afford the luxury of working with libraries like Particles.js, Three,js, GSAP and Nuxt.js.",
    "experiencia_jl_logos": [],
    "experiencia_legal_titulo": "LegalSpain",
    "experiencia_legal_fecha": "June 2023 - July 2023",
    "experiencia_legal_subtitulo": "Website developed as a FreeLancer for LegalSpain, developed with Elementor (Wordpress).",
    "experiencia_legal_textos_1": "This website is merely informative, I also took care of optimizing it to improve its SEO, I also found plugins so that the forms are sent to a mail section of the company.",
    "experiencia_legal_logos": [],
    "conocimientos_titulo": "Knowledge",
    "conocimientos_vue": "Since I started in frontend development, I have worked with Vue.js for three years, two with Vue 2 and one with Vue 3. In addition, I have worked with Vuex, a state management library for Vue.js. Recently I have started to explore Pinia, a simpler and more modular state management solution than Vuex. I have also set up projects with Nuxt, a Vue.js-based framework for creating modern web applications. Although my experience is solid, I am always looking to learn and adapt to new technologies and practices in the world of frontend development.",
    "conocimientos_figma": "I love web design, I know how to use Figma, Photoshop, Illustrator and After Effects. I leave you my portfolio of designs here.",
    "conocimientos_javascript": "As a frontend developer specialized in JavaScript, I have acquired a solid understanding of array manipulation and functions. These are two of the fundamental concepts of JavaScript that are essential for any type of web development. My experience in creating a memory game is a testament to my ability to effectively apply these concepts. In this game, arrays play a crucial role in tracking the cards selected by the player.",
    "conocimientos_css": "Of all the languages and frameworks mentioned above css is my favorite :P",
    "conocimientos_bootstrap": "As a web developer with good knowledge of CSS, I do not consider Bootstrap essential, but very useful. With three years of experience in its use, it has facilitated the creation of attractive and efficient user interfaces quickly.",
    "conocimientos_gsap": "As can be seen in my work, I have a great appreciation for GSAP, one of my favorite libraries. GSAP, is a JavaScript library that allows me to create high quality and performance animations for my web projects.",
    "conocimientos_spline": "SPLINE SPLINE SPLINE SPLINE SPLINE SPLINE SPLINE SPLINE SPLINE SPLINE SPLINE SPLINE SPLINE SPLINE SPLINE SPLINE SPLINE SPLINE SPLINE SPLINE SPLINE SPLINE SPLINE SPLINE SPLINE SPLINE SPLINE SPLINE SPLINE SPLINE SPLINE ",
    "conocimientos_node": "My experience with Node.js extends over the last two and a half years, where I have used this JavaScript runtime to develop both on the server side and the client side outside of the web browser. I have built a secure REST API with Node.js, one of its most common applications. To facilitate the creation of servers and route management, I have used Express.js, a framework for Node.js. One of my highlighted projects is a web application that allows users to search for beers by name or type, developed with Node.js and Express.js.",
    "conocimientos_react": "For now I have little experience in React and Next, although I have been studying it on my own I have not had the opportunity to develop any project completely.",
    "proyecto_titulo": "Do you want to see how I organize my projects?",
    "formulario_titulo": "Do you need a website as cool as this one?",
    "formulario_email": "Email",
    "formulario_telefono": "Phone (Optional)",
    "formulario_mensaje": "Message",
    "formulario_boton": "Send"
  }
  